betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_fmc.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_fmc.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file contains all the functions prototypes for the FMC
*                      firmware library.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32H417_FMC_H
#define __CH32H417_FMC_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "ch32h417.h"

/* FMC Init structure definition */
typedef struct
{
  uint32_t FMC_AddressSetupTime;       /* Defines the number of HCLK cycles to configure
                                           the duration of the address setup time.
                                           This parameter can be a value between 0 and 0xF.
                                           @note: It is not used with synchronous NOR Flash memories. */

  uint32_t FMC_AddressHoldTime;        /* Defines the number of HCLK cycles to configure
                                           the duration of the address hold time.
                                           This parameter can be a value between 0 and 0xF.
                                           @note: It is not used with synchronous NOR Flash memories.*/

  uint32_t FMC_DataSetupTime;          /* Defines the number of HCLK cycles to configure
                                           the duration of the data setup time.
                                           This parameter can be a value between 0 and 0xFF.
                                           @note: It is used for SRAMs, ROMs and asynchronous multiplexed NOR Flash memories. */

  uint32_t FMC_BusTurnAroundDuration;  /* Defines the number of HCLK cycles to configure
                                           the duration of the bus turnaround.
                                           This parameter can be a value between 0 and 0xF.
                                           @note: It is only used for multiplexed NOR Flash memories. */

  uint32_t FMC_CLKDivision;            /* Defines the period of CLK clock output signal, expressed in number of HCLK cycles.
                                           This parameter can be a value between 1 and 0xF.
                                           @note: This parameter is not used for asynchronous NOR Flash, SRAM or ROM accesses. */

  uint32_t FMC_DataLatency;            /* Defines the number of memory clock cycles to issue
                                           to the memory before getting the first data.
                                           The value of this parameter depends on the memory type as shown below:
                                              - It must be set to 0 in case of a CRAM
                                              - It is don't care in asynchronous NOR, SRAM or ROM accesses
                                              - It may assume a value between 0 and 0xF in NOR Flash memories
                                                with synchronous burst mode enable */

  uint32_t FMC_AccessMode;             /* Specifies the asynchronous access mode.
                                            This parameter can be a value of @ref FMC_Access_Mode */
}FMC_NORSRAMTimingInitTypeDef;

typedef struct
{
  uint32_t FMC_Bank;                /* Specifies the NOR/SRAM memory bank that will be used.
                                        This parameter can be a value of @ref FMC_NORSRAM_Bank */

  uint32_t FMC_DataAddressMux;      /* Specifies whether the address and data values are
                                        multiplexed on the databus or not.
                                        This parameter can be a value of @ref FMC_Data_Address_Bus_Multiplexing */

  uint32_t FMC_MemoryType;          /* Specifies the type of external memory attached to
                                        the corresponding memory bank.
                                        This parameter can be a value of @ref FMC_Memory_Type */

  uint32_t FMC_MemoryDataWidth;     /* Specifies the external memory device width.
                                        This parameter can be a value of @ref FMC_Data_Width */

  uint32_t FMC_BurstAccessMode;     /* Enables or disables the burst access mode for Flash memory,
                                        valid only with synchronous burst Flash memories.
                                        This parameter can be a value of @ref FMC_Burst_Access_Mode */
                                       
  uint32_t FMC_AsynchronousWait;    /* Enables or disables wait signal during asynchronous transfers,
                                        valid only with asynchronous Flash memories.
                                        This parameter can be a value of @ref FMC_AsynchronousWait */

  uint32_t FMC_WaitSignalPolarity;  /* Specifies the wait signal polarity, valid only when accessing
                                        the Flash memory in burst mode.
                                        This parameter can be a value of @ref FMC_Wait_Signal_Polarity */

  uint32_t FMC_WaitSignalActive;    /* Specifies if the wait signal is asserted by the memory one
                                        clock cycle before the wait state or during the wait state,
                                        valid only when accessing memories in burst mode.
                                        This parameter can be a value of @ref FMC_Wait_Timing */

  uint32_t FMC_WriteOperation;      /* Enables or disables the write operation in the selected bank by the FMC.
                                        This parameter can be a value of @ref FMC_Write_Operation */

  uint32_t FMC_WaitSignal;          /* Enables or disables the wait-state insertion via wait
                                        signal, valid for Flash memory access in burst mode.
                                        This parameter can be a value of @ref FMC_Wait_Signal */

  uint32_t FMC_ExtendedMode;        /* Enables or disables the extended mode.
                                        This parameter can be a value of @ref FMC_Extended_Mode */

  uint32_t FMC_WriteBurst;          /* Enables or disables the write burst operation.
                                        This parameter can be a value of @ref FMC_Write_Burst */

  uint32_t FMC_CPSIZE;              /* Specifies the external CRAM page size.
                                        This parameter can be a value of @ref FMC_CPSIZE */

  uint32_t FMC_BMP;                 /* Specifies the address mapping.
                                        This parameter can be a value of @ref FMC_BMP */                                          

  FMC_NORSRAMTimingInitTypeDef* FMC_ReadWriteTimingStruct; /* Timing Parameters for write and read access if the  ExtendedMode is not used*/

  FMC_NORSRAMTimingInitTypeDef* FMC_WriteTimingStruct;     /* Timing Parameters for write access if the  ExtendedMode is used*/
}FMC_NORSRAMInitTypeDef;

typedef struct
{
  uint32_t FMC_SetupTime;      /* Defines the number of HCLK cycles to setup address before
                                   the command assertion for NAND-Flash read or write access
                                   to common/Attribute or I/O memory space (depending on
                                   the memory space timing to be configured).
                                   This parameter can be a value between 0 and 0xFF.*/

