betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_fmc.h
  uint32_t FMC_WaitSetupTime;  /* Defines the minimum number of HCLK cycles to assert the
                                   command for NAND-Flash read or write access to
                                   common/Attribute or I/O memory space (depending on the
                                   memory space timing to be configured).
                                   This parameter can be a number between 0x00 and 0xFF */

  uint32_t FMC_HoldSetupTime;  /* Defines the number of HCLK clock cycles to hold address
                                   (and data for write access) after the command deassertion
                                   for NAND-Flash read or write access to common/Attribute
                                   or I/O memory space (depending on the memory space timing
                                   to be configured).
                                   This parameter can be a number between 0x00 and 0xFF */

  uint32_t FMC_HiZSetupTime;   /* Defines the number of HCLK clock cycles during which the
                                   databus is kept in HiZ after the start of a NAND-Flash
                                   write access to common/Attribute or I/O memory space (depending
                                   on the memory space timing to be configured).
                                   This parameter can be a number between 0x00 and 0xFF */
}FMC_NAND_PCCARDTimingInitTypeDef;


typedef struct
{
  uint32_t FMC_Bank;             /* Specifies the NAND memory bank that will be used.
                                     This parameter can be a value of @ref FMC_NAND_Bank */

  uint32_t FMC_Waitfeature;      /* Enables or disables the Wait feature for the NAND Memory Bank.
                                     This parameter can be any value of @ref FMC_Wait_feature */

  uint32_t FMC_MemoryDataWidth;  /* Specifies the external memory device width.
                                     This parameter can be any value of @ref FMC_NAND_Data_Width */

  uint32_t FMC_ECC;              /* Enables or disables the ECC computation.
                                     This parameter can be any value of @ref FMC_ECC */

  uint32_t FMC_ECCPageSize;      /* Defines the page size for the extended ECC.
                                     This parameter can be any value of @ref FMC_ECC_Page_Size */

  uint32_t FMC_TCLRSetupTime;    /* Defines the number of HCLK cycles to configure the
                                     delay between CLE low and RE low.
                                     This parameter can be a value between 0 and 0xFF. */

  uint32_t FMC_TARSetupTime;     /* Defines the number of HCLK cycles to configure the
                                     delay between ALE low and RE low.
                                     This parameter can be a number between 0x0 and 0xFF */

  FMC_NAND_PCCARDTimingInitTypeDef*  FMC_CommonSpaceTimingStruct;   /* FMC Common Space Timing */

  FMC_NAND_PCCARDTimingInitTypeDef*  FMC_AttributeSpaceTimingStruct; /* FMC Attribute Space Timing */
}FMC_NANDInitTypeDef;

/* FMC SDRAM Init structure definition */
typedef struct
{
  uint32_t FMC_LoadToActiveDelay;     /* Defines load to active delay.
                                        This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_ExitSelfRefreshDelay;  /* Defines exit self refresh delay.
                                        This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_SelfRefreshTime;       /* Defines self refresh time.
                                        This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_RowCycleDelay;         /* Defines row cycle delay.
                                        This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_WriteRecoveryTime;     /* Defines write recover time.
                                        This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_RPDelay;               /* Defines row precharge delay.
                                        This parameter can be a number between 0x0 and 0xF */   

  uint32_t FMC_RCDDelay;              /* Defines row to column delay.
                                        This parameter can be a number between 0x0 and 0xF */  

} FMC_SDRAM_TimingTypeDef;

typedef struct
{
  uint32_t FMC_Bank;               /* Specifies the SDRAM memory bank that will be used.
                                      This parameter can be a value of @ref FMC_SDRAM_Bank */

  uint32_t FMC_ColumnBitsNumber;   /* Defines the number of column bits.
                                      This parameter can be a value of @ref FMC_ColumnBitsNumber.*/

  uint32_t FMC_RowBitsNumber;      /* Defines the number of row bits.
                                      This parameter can be a value of @ref FMC_RowBitsNumber.*/

  uint32_t FMC_MemoryDataWidth;    /* Defines memory data width.
                                      This parameter can be a value of @ref FMC_MemoryDataWidth.*/  

  uint32_t FMC_InternalBankNumber; /* Defines Internal Bank Number.
                                      This parameter can be a value of @ref FMC_InternalBankNumber.*/  

  uint32_t FMC_CASLatency;         /* Defines CAS delay.
                                      This parameter can be a value of @ref FMC_CASLatency.*/  
 
  uint32_t FMC_WriteProtection;    /* Defines write protect.
                                      This parameter can be a value of @ref FMC_WriteProtection.*/   

  uint32_t FMC_SDClockPeriod;      /* Defines the SDRAM clock period.
                                      This parameter can be a value of @ref FMC_SDClockPeriod.*/   

  uint32_t FMC_ReadBurst;          /* Defines the SDRAM burst read.
                                      This parameter can be a value of @ref FMC_ReadBurst.*/

  uint32_t FMC_ReadPipeDelay;      /* Defines the SDRAM pipe delay read .
                                      This parameter can be a value of @ref FMC_ReadPipeDelay.*/

  uint32_t FMC_NRFS_CNT;           /* Defines the count of NRFS.
                                      This parameter can be a number between 0x0 and 0xF */

  uint32_t FMC_PHASE_SEL;          /* Defines Phase shift.
                                      This parameter can be a number between 0x0 and 0xF */

