betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_fmc.h
  uint32_t FMC_ENHANCE_READ_MODE;  /* Defines enhance read mode.
                                      This parameter can be a value of @ref FMC_ENHANCE_READ_MODE.*/ 

  FMC_SDRAM_TimingTypeDef* FMC_SDRAM_Timing;     
} FMC_SDRAM_InitTypeDef;

/* FMC SDRAM BANK Status enumeration */
typedef enum
{
   FMC_SDRAM_Normal = 0,
   FMC_SDRAM_SelfRefresh,
   FMC_SDRAM_PowerOff 
}FMC_SDRAM_BANK_Sta_TypeDef;

/* FMC_NORSRAM_Bank */
#define FMC_Bank1_NORSRAM1                             ((uint32_t)0x00000000)
#define FMC_Bank1_NORSRAM2                             ((uint32_t)0x00000002)
#define FMC_Bank1_NORSRAM3                             ((uint32_t)0x00000004)
#define FMC_Bank1_NORSRAM4                             ((uint32_t)0x00000006)

/* FMC_NAND_Bank */
#define FMC_Bank3_NAND                                 ((uint32_t)0x00000000)

/* FMC_SDRAM_Bank */
#define FMC_Bank5_SDRAM                                ((uint32_t)0x00000000)
#define FMC_Bank6_SDRAM                                ((uint32_t)0x00000002)

/* FMC_Data_Address_Bus_Multiplexing */
#define FMC_DataAddressMux_Disable                     ((uint32_t)0x00000000)
#define FMC_DataAddressMux_Enable                      ((uint32_t)0x00000002)

/* FMC_Memory_Type */
#define FMC_MemoryType_SRAM                            ((uint32_t)0x00000000)
#define FMC_MemoryType_PSRAM                           ((uint32_t)0x00000004)
#define FMC_MemoryType_NOR                             ((uint32_t)0x00000008)

/* FMC_Data_Width */
#define FMC_MemoryDataWidth_8b                         ((uint32_t)0x00000000)
#define FMC_MemoryDataWidth_16b                        ((uint32_t)0x00000010)
#define FMC_MemoryDataWidth_32b                        ((uint32_t)0x00000020)

/* FMC_NAND_Data_Width */
#define FMC_NAND_MemDataWidth_8b                       ((uint32_t)0x00000000)
#define FMC_NAND_MemDataWidth_16b                      ((uint32_t)0x00000010)

/* FMC_CPSIZE */
#define FMC_CPSIZE_None                                ((uint32_t)0x00000000)
#define FMC_CPSIZE_128Bytes                            ((uint32_t)0x00010000)
#define FMC_CPSIZE_256Bytes                            ((uint32_t)0x00020000)
#define FMC_CPSIZE_512Bytes                            ((uint32_t)0x00030000)
#define FMC_CPSIZE_1024Bytes                           ((uint32_t)0x00040000)

/* FMC_BMP */
#define FMC_BMP_Mode0                                  ((uint32_t)0x00000000)
#define FMC_BMP_Mode1                                  ((uint32_t)0x00010000)

/* FMC_Burst_Access_Mode */
#define FMC_BurstAccessMode_Disable                    ((uint32_t)0x00000000)
#define FMC_BurstAccessMode_Enable                     ((uint32_t)0x00000100)

/* FMC_AsynchronousWait */
#define FMC_AsynchronousWait_Disable                   ((uint32_t)0x00000000)
#define FMC_AsynchronousWait_Enable                    ((uint32_t)0x00008000)

/* FMC_Wait_Signal_Polarity */
#define FMC_WaitSignalPolarity_Low                     ((uint32_t)0x00000000)
#define FMC_WaitSignalPolarity_High                    ((uint32_t)0x00000200)

/* FMC_Wait_Timing */
#define FMC_WaitSignalActive_BeforeWaitState           ((uint32_t)0x00000000)
#define FMC_WaitSignalActive_DuringWaitState           ((uint32_t)0x00000800)

/* FMC_Write_Operation */
#define FMC_WriteOperation_Disable                     ((uint32_t)0x00000000)
#define FMC_WriteOperation_Enable                      ((uint32_t)0x00001000)

/* FMC_Wait_Signal */
#define FMC_WaitSignal_Disable                         ((uint32_t)0x00000000)
#define FMC_WaitSignal_Enable                          ((uint32_t)0x00002000)

/* FMC_Extended_Mode */
#define FMC_ExtendedMode_Disable                       ((uint32_t)0x00000000)
#define FMC_ExtendedMode_Enable                        ((uint32_t)0x00004000)

/* FMC_Write_Burst */
#define FMC_WriteBurst_Disable                         ((uint32_t)0x00000000)
#define FMC_WriteBurst_Enable                          ((uint32_t)0x00080000)

/* FMC_Access_Mode */
#define FMC_AccessMode_A                               ((uint32_t)0x00000000)
#define FMC_AccessMode_B                               ((uint32_t)0x10000000)
#define FMC_AccessMode_C                               ((uint32_t)0x20000000)
#define FMC_AccessMode_D                               ((uint32_t)0x30000000)

/* FMC_Wait_feature */
#define FMC_Waitfeature_Disable                        ((uint32_t)0x00000000)
#define FMC_Waitfeature_Enable                         ((uint32_t)0x00000002)

/* FMC_ECC */
#define FMC_ECC_Disable                                ((uint32_t)0x00000000)
#define FMC_ECC_Enable                                 ((uint32_t)0x00000040)

/* FMC_ECC_Page_Size */
#define FMC_ECCPageSize_256Bytes                       ((uint32_t)0x00000000)
#define FMC_ECCPageSize_512Bytes                       ((uint32_t)0x00020000)
#define FMC_ECCPageSize_1024Bytes                      ((uint32_t)0x00040000)
#define FMC_ECCPageSize_2048Bytes                      ((uint32_t)0x00060000)
#define FMC_ECCPageSize_4096Bytes                      ((uint32_t)0x00080000)
#define FMC_ECCPageSize_8192Bytes                      ((uint32_t)0x000A0000)

/* FMC_ColumnBitsNumber */
#define FMC_ColumnBitsNumber_8                         ((uint32_t)0x00000000)
#define FMC_ColumnBitsNumber_9                         ((uint32_t)0x00000001)
#define FMC_ColumnBitsNumber_10                        ((uint32_t)0x00000002)
#define FMC_ColumnBitsNumber_11                        ((uint32_t)0x00000003)

/* FMC_RowBitsNumber */
#define FMC_ROWBitsNumber_11                           ((uint32_t)0x00000000)
#define FMC_ROWBitsNumber_12                           ((uint32_t)0x00000001)
#define FMC_ROWBitsNumber_13                           ((uint32_t)0x00000002)

/* FMC_MemoryDataWidth */
#define FMC_MemoryDataWidth_8                          ((uint32_t)0x00000000)
#define FMC_MemoryDataWidth_16                         ((uint32_t)0x00000001)
#define FMC_MemoryDataWidth_32                         ((uint32_t)0x00000002)

/* FMC_InternalBankNumber */
#define FMC_InternalBankNumber_2                       ((uint32_t)0x00000000)
#define FMC_InternalBankNumber_4                       ((uint32_t)0x00000001)

/* FMC_CASLatency */
#define FMC_CASLatency_1CLk                            ((uint32_t)0x00000001)
#define FMC_CASLatency_2CLk                            ((uint32_t)0x00000002)
#define FMC_CASLatency_3CLk                            ((uint32_t)0x00000003)

/* FMC_WriteProtection */
#define FMC_WriteProtection_Enable                     ((uint32_t)0x00000001)
#define FMC_WriteProtection_Disable                    ((uint32_t)0x00000000)

/* FMC_SDClockPeriod */
#define FMC_SDClockPeriod_Disable                      ((uint32_t)0x00000000)
#define FMC_SDClockPeriod_2HCLK                        ((uint32_t)0x00000002)
#define FMC_SDClockPeriod_3HCLK                        ((uint32_t)0x00000003)

/* FMC_ReadBurst */
#define FMC_ReadBurst_Disable                          ((uint32_t)0x00000000)
#define FMC_ReadBurst_Enable                           ((uint32_t)0x00000001)

/* FMC_ReadPipeDelay */
#define FMC_ReadPipeDelay_none                         ((uint32_t)0x00000000)
#define FMC_ReadPipeDelay_1HCLK                        ((uint32_t)0x00000001)
#define FMC_ReadPipeDelay_2HCLK                        ((uint32_t)0x00000002)

