betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_fmc.h
/* FMC_ENHANCE_READ_MODE */
#define FMC_ENHANCE_READ_MODE_Enable                   ((uint32_t)0x00000000)
#define FMC_ENHANCE_READ_MODE_Disable                  ((uint32_t)0x00008000)

/* FMC_SDRAM_SEL */
#define FMC_SDRAM_SEL_None                             ((uint32_t)0x00000000)
#define FMC_SDRAM_SEL_Bank5                            ((uint32_t)0x00000010)
#define FMC_SDRAM_SEL_Bank6                            ((uint32_t)0x00000008)
#define FMC_SDRAM_SEL_Bank5_6                          ((uint32_t)0x00000018)

/* FMC_SDRAM_CMD_Mode */
#define FMC_SDRAM_CMD_Mode0                            ((uint32_t)0x00000000)
#define FMC_SDRAM_CMD_Mode1                            ((uint32_t)0x00000001)
#define FMC_SDRAM_CMD_Mode2                            ((uint32_t)0x00000002)
#define FMC_SDRAM_CMD_Mode3                            ((uint32_t)0x00000003)
#define FMC_SDRAM_CMD_Mode4                            ((uint32_t)0x00000004)
#define FMC_SDRAM_CMD_Mode5                            ((uint32_t)0x00000005)
#define FMC_SDRAM_CMD_Mode6                            ((uint32_t)0x00000006)

/* FMC_interrupts_definition */
#define FMC_IT_RE                                      ((uint32_t)0x00004000))

/* FMC_flags_definition */
#define FMC_FLAG_FEMPT                                 ((uint32_t)0x00000040)
#define FMC_FLAG_BUSY                                  ((uint32_t)0x10000020))
#define FMC_FLAG_RE                                    ((uint32_t)0x10000001))


void FMC_DeInit(void);
void FMC_NORSRAMDeInit(uint32_t FMC_Bank);
void FMC_NANDDeInit(uint32_t FMC_Bank);
void FMC_NORSRAMInit(FMC_NORSRAMInitTypeDef *FMC_NORSRAMInitStruct);
void FMC_NANDInit(FMC_NANDInitTypeDef *FMC_NANDInitStruct);
void FMC_SDRAM_Init(FMC_SDRAM_InitTypeDef *FMC_SDRAMInitStruct);
void FMC_NORSRAMStructInit(FMC_NORSRAMInitTypeDef *FMC_NORSRAMInitStruct);
void FMC_NANDStructInit(FMC_NANDInitTypeDef *FMC_NANDInitStruct);
void FMC_SDRAM_SendCMDConfig(uint32_t SDRAM_Sel, uint32_t CMD_Mode, uint32_t CMD_Refresh_cnt, uint32_t SDRAM_ModeREG);
void FMC_NORSRAM_NANDCmd(FunctionalState NewState);
void FMC_NORSRAMCmd(uint32_t FMC_Bank, FunctionalState NewState);
void FMC_SDRAMCmd(uint32_t FMC_SDRAMBank, FunctionalState NewState);
void FMC_NANDCmd(uint32_t FMC_Bank, FunctionalState NewState);
void FMC_NANDECCCmd(uint32_t FMC_Bank, FunctionalState NewState);
uint32_t FMC_GetECC(uint32_t FMC_Bank);
void FMC_SDRAM_SetRefreshCnt(uint16_t Refresh_Cnt);
FMC_SDRAM_BANK_Sta_TypeDef FMC_SDRAM_GetBankSta(uint32_t SDRAM_Bank);
void FMC_ITConfig(uint32_t FMC_IT, FunctionalState NewState);
ITStatus FMC_GetITStatus(uint32_t FMC_IT);
void FMC_ClearITPendingBit(uint32_t FMC_IT);
FlagStatus FMC_GetFlagStatus(uint32_t FMC_FLAG);
void FMC_ClearFlag(uint32_t FMC_FLAG);



#ifdef __cplusplus
}
#endif

#endif 
